In [2]:
!pip install pymysql

Collecting pymysql
  Using cached PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [3]:
import pymysql
import pandas as pd

In [4]:
connection = pymysql.connect(host='localhost', port=3307, user="root",
                            password="root", database="shopapp")

In [6]:
query = "select * from employees";

In [7]:
pd.read_sql(query, connection)

,e_id,firstname,lastname,dept,job_title,phone,city,salary
0,101,Ram,Sharma,IT,Software Developer,989765431,Delhi,55000
1,102,Mohit,Sharma,IT,Software Developer,989765241,Delhi,45000
2,103,Aman,Kumar,Sales,Sales Admin,989765241,Delhi,70000
3,104,Pooja,Tyagi,HR,HR Head,989365241,Delhi,60000
4,105,Pooja,Sharma,IT,Tester,989365841,Delhi,35000
5,106,Deep,Singh,IT,Tester,989365811,Pune,45000
6,107,Aastha,Singh,HR,HR Manager,989165811,Pune,75000
7,108,Rakesh,Kapoor,IT,Web Developer,989165011,Chennai,65000